Tekla Open API Reference for Tekla Structures 2025
PointList.Add Method
 Adds a new point to the end of the point list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Add(
	Point value
)
Public Function Add (
	value As Point
) As Integer
Parameters
value
Type: Tekla.Structures.Geometry3d.Point
The point to be added to the list.
Return Value
Type: Int32
The index where the point was added.
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace